{"class_name": "Functional", "config": {"name": "model_12", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 40, 30, 9], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_13"}, "name": "input_13", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_372", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_372", "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_336", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_336", "inbound_nodes": [[["conv2d_372", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_336", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_336", "inbound_nodes": [[["batch_normalization_336", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_373", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_373", "inbound_nodes": [[["activation_336", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_337", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_337", "inbound_nodes": [[["conv2d_373", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_337", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_337", "inbound_nodes": [[["batch_normalization_337", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_374", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_374", "inbound_nodes": [[["activation_337", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_338", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_338", "inbound_nodes": [[["conv2d_374", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_338", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_338", "inbound_nodes": [[["batch_normalization_338", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_376", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_376", "inbound_nodes": [[["activation_336", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_375", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_375", "inbound_nodes": [[["activation_338", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_108", "trainable": true, "dtype": "float32"}, "name": "add_108", "inbound_nodes": [[["conv2d_376", 0, 0, {}], ["conv2d_375", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_339", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_339", "inbound_nodes": [[["add_108", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_339", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_339", "inbound_nodes": [[["batch_normalization_339", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_377", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_377", "inbound_nodes": [[["activation_339", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_340", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_340", "inbound_nodes": [[["conv2d_377", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_340", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_340", "inbound_nodes": [[["batch_normalization_340", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_378", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_378", "inbound_nodes": [[["activation_340", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_341", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_341", "inbound_nodes": [[["conv2d_378", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_341", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_341", "inbound_nodes": [[["batch_normalization_341", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_379", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_379", "inbound_nodes": [[["activation_341", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_109", "trainable": true, "dtype": "float32"}, "name": "add_109", "inbound_nodes": [[["add_108", 0, 0, {}], ["conv2d_379", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_342", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_342", "inbound_nodes": [[["add_109", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_342", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_342", "inbound_nodes": [[["batch_normalization_342", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_380", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_380", "inbound_nodes": [[["activation_342", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_343", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_343", "inbound_nodes": [[["conv2d_380", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_343", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_343", "inbound_nodes": [[["batch_normalization_343", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_381", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_381", "inbound_nodes": [[["activation_343", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_344", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_344", "inbound_nodes": [[["conv2d_381", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_344", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_344", "inbound_nodes": [[["batch_normalization_344", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_382", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_382", "inbound_nodes": [[["activation_344", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_110", "trainable": true, "dtype": "float32"}, "name": "add_110", "inbound_nodes": [[["add_109", 0, 0, {}], ["conv2d_382", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_345", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_345", "inbound_nodes": [[["add_110", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_345", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_345", "inbound_nodes": [[["batch_normalization_345", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_383", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_383", "inbound_nodes": [[["activation_345", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_346", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_346", "inbound_nodes": [[["conv2d_383", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_346", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_346", "inbound_nodes": [[["batch_normalization_346", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_384", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_384", "inbound_nodes": [[["activation_346", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_347", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_347", "inbound_nodes": [[["conv2d_384", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_347", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_347", "inbound_nodes": [[["batch_normalization_347", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_386", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_386", "inbound_nodes": [[["add_110", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_385", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_385", "inbound_nodes": [[["activation_347", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_111", "trainable": true, "dtype": "float32"}, "name": "add_111", "inbound_nodes": [[["conv2d_386", 0, 0, {}], ["conv2d_385", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_348", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_348", "inbound_nodes": [[["add_111", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_348", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_348", "inbound_nodes": [[["batch_normalization_348", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_387", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_387", "inbound_nodes": [[["activation_348", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_349", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_349", "inbound_nodes": [[["conv2d_387", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_349", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_349", "inbound_nodes": [[["batch_normalization_349", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_388", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_388", "inbound_nodes": [[["activation_349", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_350", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_350", "inbound_nodes": [[["conv2d_388", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_350", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_350", "inbound_nodes": [[["batch_normalization_350", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_389", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_389", "inbound_nodes": [[["activation_350", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_112", "trainable": true, "dtype": "float32"}, "name": "add_112", "inbound_nodes": [[["add_111", 0, 0, {}], ["conv2d_389", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_351", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_351", "inbound_nodes": [[["add_112", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_351", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_351", "inbound_nodes": [[["batch_normalization_351", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_390", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_390", "inbound_nodes": [[["activation_351", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_352", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_352", "inbound_nodes": [[["conv2d_390", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_352", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_352", "inbound_nodes": [[["batch_normalization_352", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_391", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_391", "inbound_nodes": [[["activation_352", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_353", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_353", "inbound_nodes": [[["conv2d_391", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_353", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_353", "inbound_nodes": [[["batch_normalization_353", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_392", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_392", "inbound_nodes": [[["activation_353", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_113", "trainable": true, "dtype": "float32"}, "name": "add_113", "inbound_nodes": [[["add_112", 0, 0, {}], ["conv2d_392", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_354", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_354", "inbound_nodes": [[["add_113", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_354", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_354", "inbound_nodes": [[["batch_normalization_354", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_393", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_393", "inbound_nodes": [[["activation_354", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_355", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_355", "inbound_nodes": [[["conv2d_393", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_355", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_355", "inbound_nodes": [[["batch_normalization_355", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_394", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_394", "inbound_nodes": [[["activation_355", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_356", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_356", "inbound_nodes": [[["conv2d_394", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_356", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_356", "inbound_nodes": [[["batch_normalization_356", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_396", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_396", "inbound_nodes": [[["add_113", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_395", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_395", "inbound_nodes": [[["activation_356", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_114", "trainable": true, "dtype": "float32"}, "name": "add_114", "inbound_nodes": [[["conv2d_396", 0, 0, {}], ["conv2d_395", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_357", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_357", "inbound_nodes": [[["add_114", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_357", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_357", "inbound_nodes": [[["batch_normalization_357", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_397", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_397", "inbound_nodes": [[["activation_357", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_358", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_358", "inbound_nodes": [[["conv2d_397", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_358", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_358", "inbound_nodes": [[["batch_normalization_358", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_398", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_398", "inbound_nodes": [[["activation_358", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_359", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_359", "inbound_nodes": [[["conv2d_398", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_359", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_359", "inbound_nodes": [[["batch_normalization_359", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_399", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_399", "inbound_nodes": [[["activation_359", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_115", "trainable": true, "dtype": "float32"}, "name": "add_115", "inbound_nodes": [[["add_114", 0, 0, {}], ["conv2d_399", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_360", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_360", "inbound_nodes": [[["add_115", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_360", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_360", "inbound_nodes": [[["batch_normalization_360", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_400", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_400", "inbound_nodes": [[["activation_360", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_361", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_361", "inbound_nodes": [[["conv2d_400", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_361", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_361", "inbound_nodes": [[["batch_normalization_361", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_401", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_401", "inbound_nodes": [[["activation_361", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_362", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_362", "inbound_nodes": [[["conv2d_401", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_362", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_362", "inbound_nodes": [[["batch_normalization_362", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_402", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_402", "inbound_nodes": [[["activation_362", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_116", "trainable": true, "dtype": "float32"}, "name": "add_116", "inbound_nodes": [[["add_115", 0, 0, {}], ["conv2d_402", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_363", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_363", "inbound_nodes": [[["add_116", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_363", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_363", "inbound_nodes": [[["batch_normalization_363", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_12", "trainable": true, "dtype": "float32", "pool_size": [8, 8], "padding": "valid", "strides": [8, 8], "data_format": "channels_last"}, "name": "average_pooling2d_12", "inbound_nodes": [[["activation_363", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_12", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_12", "inbound_nodes": [[["average_pooling2d_12", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_12", "inbound_nodes": [[["flatten_12", 0, 0, {}]]]}], "input_layers": [["input_13", 0, 0]], "output_layers": [["dense_12", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}